import json # Подключаем библиотеку 

with open('dump.json', 'r') as file: # Открываем файл для чтения
    file1 = json.load(file) # Записываем информацию  из файла, load() декодирует файл JSON и возвращает объект

qualifNumb = input("Введите номер квалификации : ") # Запрос числа от пользователя

find = True # Предположим, что  найдено

print("\n ================== Результат поиска ==================\n")

for i in file1:
    if i['model'] == qualifNumb:
        print("\n ================== Найдено ==================\n")
        print( f" {i['model']}  >> Специальность  {i['speciality']}  ,{i['PTO']} " )

if not find:
    print("\n ================== Не найдено ==================\n")
